using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Infrastructure
{
    /// <summary>
    /// 由于省不是在数据库中维护, 所以提供一个省份的帮助类
    /// </summary>
    public class ProvinceHelper
    {
        #region 省份和城市对应字典 + static readonly Dictionary<string, string[]> provinceCityDic
        /// <summary>
        /// 省份和城市对应字典
        /// </summary>
        public static readonly Dictionary<string, string[]> provinceCityDic = GetProvinceCityDic(); 
        #endregion

        #region 所有的省 + static readonly string[] arrProvince
        /// <summary>
        /// 所有的省
        /// </summary>
        public static readonly string[] arrProvince = new string[34] 
        { 
            "北京", "上海", "天津", "重庆", "河北", "山西", "内蒙古", "辽宁", "吉林", "黑龙江", "江苏", "浙江", "安徽", "福建", "江西", "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "四川", "贵州", "云南", "西藏", "陕西", "甘肃", "宁夏", "青海", "新疆", "香港", "澳门", "台湾"
        }; 
        #endregion

        #region 所有城市(与省份位置一一对应) + static readonly string[] arrCit
        /// <summary>
        /// 所有城市(与省份位置一一对应)
        /// </summary>
        public static readonly string[] arrCity = new string[34] 
        {
            "北京", 
            "上海", 
            "天津", 
            "重庆", 
            "石家庄,邯郸,邢台,保定,张家口,承德,廊坊,唐山,秦皇岛,沧州,衡水",
            "太原,大同,阳泉,长治,晋城,朔州,吕梁,忻州,晋中,临汾,运城",
            "呼和浩特,包头,乌海,赤峰,呼伦贝尔盟,阿拉善盟,哲里木盟,兴安盟,乌兰察布盟,锡林郭勒盟,巴彦淖尔盟,伊克昭盟",
            "沈阳,大连,鞍山,抚顺,本溪,丹东,锦州,营口,阜新,辽阳,盘锦,铁岭,朝阳,葫芦岛",
            "长春,吉林,四平,辽源,通化,白山,松原,白城,延边",
            "哈尔滨,齐齐哈尔,牡丹江,佳木斯,大庆,绥化,鹤岗,鸡西,黑河,双鸭山,伊春,七台河,大兴安岭",
            "南京,镇江,苏州,南通,扬州,盐城,徐州,连云港,常州,无锡,宿迁,泰州,淮安",
            "杭州,宁波,温州,嘉兴,湖州,绍兴,金华,衢州,舟山,台州,丽水",
            "合肥,芜湖,蚌埠,马鞍山,淮北,铜陵,安庆,黄山,滁州,宿州,池州,淮南,巢湖,阜阳,六安,宣城,亳州",
            "福州,厦门,莆田,三明,泉州,漳州,南平,龙岩,宁德",
            "南昌市,景德镇,九江,鹰潭,萍乡,新馀,赣州,吉安,宜春,抚州,上饶",
            "济南,青岛,淄博,枣庄,东营,烟台,潍坊,济宁,泰安,威海,日照,莱芜,临沂,德州,聊城,滨州,菏泽,博兴",
            "郑州,开封,洛阳,平顶山,安阳,鹤壁,新乡,焦作,濮阳,许昌,漯河,三门峡,南阳,商丘,信阳,周口,驻马店,济源",
            "武汉,宜昌,荆州,襄樊,黄石,荆门,黄冈,十堰,恩施,潜江,天门,仙桃,随州,咸宁,孝感,鄂州",
            "长沙,常德,株洲,湘潭,衡阳,岳阳,邵阳,益阳,娄底,怀化,郴州,永州,湘西,张家界",
            "广州,深圳,珠海,汕头,东莞,中山,佛山,韶关,江门,湛江,茂名,肇庆,惠州,梅州,汕尾,河源,阳江,清远,潮州,揭阳,云浮",
            "南宁,柳州,桂林,梧州,北海,防城港,钦州,贵港,玉林,南宁地区,柳州地区,贺州,百色,河池",
            "海口,三亚",
            "成都,绵阳,德阳,自贡,攀枝花,广元,内江,乐山,南充,宜宾,广安,达川,雅安,眉山,甘孜,凉山,泸州",
            "贵阳,六盘水,遵义,安顺,铜仁,黔西南,毕节,黔东南,黔南",
            "昆明,大理,曲靖,玉溪,昭通,楚雄,红河,文山,普洱,西双版纳,保山,德宏,丽江,怒江,迪庆,临沧",
            "拉萨,日喀则,山南,林芝,昌都,阿里,那曲",
            "西安,宝鸡,咸阳,铜川,渭南,延安,榆林,汉中,安康,商洛",
            "兰州,嘉峪关,金昌,白银,天水,酒泉,张掖,武威,定西,陇南,平凉,庆阳,临夏,甘南",
            "银川,石嘴山,吴忠,固原",
            "西宁,海东,海南,海北,黄南,玉树,果洛,海西",
            "乌鲁木齐,石河子,克拉玛依,伊犁,巴音郭勒,昌吉,克孜勒苏柯尔克孜,博尔塔拉,吐鲁番,哈密,喀什,和田,阿克苏",
            "香港",
            "澳门",
            "台北",
        }; 
        #endregion

        #region 省份和城市对应字典 - static Dictionary<string, string[]> GetProvinceCityDic()
        /// <summary>
        /// 省份和城市对应字典
        /// </summary>
        /// <returns></returns>
        private static Dictionary<string, string[]> GetProvinceCityDic()
        {
            Dictionary<string, string[]> dic = new Dictionary<string, string[]>();
            dic.Add("北京", new string[] { "北京" });
            dic.Add("上海", new string[] { "上海" });
            dic.Add("天津", new string[] { "天津" });
            dic.Add("重庆", new string[] { "重庆" });
            dic.Add("河北", new string[] { "石家庄", "邯郸", "邢台", "保定", "张家口", "承德", "廊坊", "唐山", "秦皇岛", "沧州", "衡水" });
            dic.Add("山西", new string[] { "太原", "大同", "阳泉", "长治", "晋城", "朔州", "吕梁", "忻州", "晋中", "临汾", "运城" });
            dic.Add("内蒙古", new string[] { "呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔盟", "阿拉善盟", "哲里木盟", "兴安盟", "乌兰察布盟", "锡林郭勒盟", "巴彦淖尔盟", "伊克昭盟" });
            dic.Add("辽宁", new string[] { "沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛" });
            dic.Add("吉林", new string[] { "长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边" });
            dic.Add("黑龙江", new string[] { "哈尔滨", "齐齐哈尔", "牡丹江", "佳木斯", "大庆", "绥化", "鹤岗", "鸡西", "黑河", "双鸭山", "伊春", "七台河", "大兴安岭" });
            dic.Add("江苏", new string[] { "南京", "镇江", "苏州", "南通", "扬州", "盐城", "徐州", "连云港", "常州", "无锡", "宿迁", "泰州", "淮安" });
            dic.Add("浙江", new string[] { "杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水" });
            dic.Add("安徽", new string[] { "合肥", "芜湖", "蚌埠", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "宿州", "池州", "淮南", "巢湖", "阜阳", "六安", "宣城", "亳州" });
            dic.Add("福建", new string[] { "福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德" });
            dic.Add("江西", new string[] { "南昌市", "景德镇", "九江", "鹰潭", "萍乡", "新馀", "赣州", "吉安", "宜春", "抚州", "上饶" });
            dic.Add("山东", new string[] { "济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽", "博兴" });
            dic.Add("河南", new string[] { "郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店", "济源" });
            dic.Add("湖北", new string[] { "武汉", "宜昌", "荆州", "襄樊", "黄石", "荆门", "黄冈", "十堰", "恩施", "潜江", "天门", "仙桃", "随州", "咸宁", "孝感", "鄂州" });
            dic.Add("湖南", new string[] { "长沙", "常德", "株洲", "湘潭", "衡阳", "岳阳", "邵阳", "益阳", "娄底", "怀化", "郴州", "永州", "湘西", "张家界" });
            dic.Add("广东", new string[] { "广州", "深圳", "珠海", "汕头", "东莞", "中山", "佛山", "韶关", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "潮州", "揭阳", "云浮" });
            dic.Add("广西", new string[] { "南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "南宁地区", "柳州地区", "贺州", "百色", "河池" });
            dic.Add("海南", new string[] { "海口", "三亚" });
            dic.Add("四川", new string[] { "成都", "绵阳", "德阳", "自贡", "攀枝花", "广元", "内江", "乐山", "南充", "宜宾", "广安", "达川", "雅安", "眉山", "甘孜", "凉山", "泸州" });
            dic.Add("贵州", new string[] { "贵阳", "六盘水", "遵义", "安顺", "铜仁", "黔西南", "毕节", "黔东南", "黔南" });
            dic.Add("云南", new string[] { "昆明", "大理", "曲靖", "玉溪", "昭通", "楚雄", "红河", "文山", "普洱", "西双版纳", "保山", "德宏", "丽江", "怒江", "迪庆", "临沧" });
            dic.Add("西藏", new string[] { "拉萨", "日喀则", "山南", "林芝", "昌都", "阿里", "那曲" });
            dic.Add("陕西", new string[] { "西安", "宝鸡", "咸阳", "铜川", "渭南", "延安", "榆林", "汉中", "安康", "商洛" });
            dic.Add("甘肃", new string[] { "兰州", "嘉峪关", "金昌", "白银", "天水", "酒泉", "张掖", "武威", "定西", "陇南", "平凉", "庆阳", "临夏", "甘南" });
            dic.Add("宁夏", new string[] { "银川", "石嘴山", "吴忠", "固原" });
            dic.Add("青海", new string[] { "西宁", "海东", "海南", "海北", "黄南", "玉树", "果洛", "海西" });
            dic.Add("新疆", new string[] { "乌鲁木齐", "石河子", "克拉玛依", "伊犁", "巴音郭勒", "昌吉", "克孜勒苏柯尔克孜", "博尔塔拉", "吐鲁番", "哈密", "喀什", "和田", "阿克苏" });
            dic.Add("香港", new string[] { "香港" });
            dic.Add("澳门", new string[] { "澳门" });
            dic.Add("台湾", new string[] { "台北" });
            return dic;
        } 
        #endregion

        #region 根据省名称获取省的位置 + static int GetProvincePosition(string province)
        /// <summary>
        /// 根据省名称获取省的位置
        /// </summary>
        /// <param name="province">省份名称</param>
        /// <returns>-1:不存在</returns>
        public static int GetProvincePosition(string province)
        {
            for (int i = 0; i < arrProvince.Length; i++)
            {
                if (arrProvince[i] == province)
                {
                    return i;
                }
            }
            return -1;
        }
        #endregion

        #region 判断省份(位置)下是否存在此城市 +  static int ExistsCity(int provincePosition, string city)
        /// <summary>
        /// 判断省份(位置)下是否存在此城市
        /// </summary>
        /// <param name="provincePosition">省份位置</param>
        /// <param name="city">城市名称</param>
        /// <returns>-1:位置超出限制; 1:存在; 0:不存在</returns>
        public static int ExistsCity(int provincePosition, string city)
        {
            //1. 判断省份位置是否有效
            if (provincePosition < 0 || provincePosition > 33)
            {
                return -1;
            }
            return arrCity[provincePosition].Contains(city) ? 1 : 0;
        } 
        #endregion
    }
}
